In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
excel_file = pd.ExcelFile('excel_data_to_clean.xlsx')

sheet_names = excel_file.sheet_names

In [3]:
sheet_names

['Final Data', 'Raw Data']

In [4]:
df = pd.read_excel('excel_data_to_clean.xlsx', sheet_name="Raw Data")

In [5]:
# printing out the number of rows and columns in the dataframe
df.shape

(10002, 8)

In [6]:
df.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,Date,SalesRep,Product,Units,Price,Total Sales,City
2,NaN,2013-01-01 00:00:00,Isabel Cross (903),Nestle Aero Mint Potz,4,495,1980,Ranchi_East
3,NaN,2013-01-02 00:00:00,Cecilia Manning (403),Nestle Smarties Pop-Up,2,438,876,Trivandrum_South
4,NaN,2013-01-02 00:00:00,Isabel Cross (705),Nestle Maxibon Cookie,1,426,426,Ranchi_East

In [7]:
df["Unnamed: 0"].value_counts()

Series([], Name: count, dtype: int64)

In [8]:
df.drop(columns=["Unnamed: 0"], axis=1, inplace=True)

In [9]:
df.rename(columns={"Unnamed: 1": "Date", "Unnamed: 2": "SalesRep", "Unnamed: 3": "Product", "Unnamed: 4": "Units", "Unnamed: 5": "Price", "Unnamed: 6": "Total Sales", "Unnamed: 7": "City"}, inplace=True)

In [10]:
df.drop([0, 1], inplace=True)

In [11]:
df.reset_index(drop=True, inplace=True)

In [12]:
df.head()

,Date,SalesRep,Product,Units,Price,Total Sales,City
0,2013-01-01 00:00:00,Isabel Cross (903),Nestle Aero Mint Potz,4,495,1980,Ranchi_East
1,2013-01-02 00:00:00,Cecilia Manning (403),Nestle Smarties Pop-Up,2,438,876,Trivandrum_South
2,2013-01-02 00:00:00,Isabel Cross (705),Nestle Maxibon Cookie,1,426,426,Ranchi_East
3,2013-01-02 00:00:00,Shari Silva (321),Nestle Maxibon Cookie,2,260,520,Mysore_South
4,2013-01-02 00:00:00,Trevor Jones (802),Nestle Toffee Crumble,4,285,1140,Pune_West

In [13]:
df['Date'] = pd.to_datetime(df['Date']).dt.date

In [14]:
df.head()

,Date,SalesRep,Product,Units,Price,Total Sales,City
0,2013-01-01,Isabel Cross (903),Nestle Aero Mint Potz,4,495,1980,Ranchi_East
1,2013-01-02,Cecilia Manning (403),Nestle Smarties Pop-Up,2,438,876,Trivandrum_South
2,2013-01-02,Isabel Cross (705),Nestle Maxibon Cookie,1,426,426,Ranchi_East
3,2013-01-02,Shari Silva (321),Nestle Maxibon Cookie,2,260,520,Mysore_South
4,2013-01-02,Trevor Jones (802),Nestle Toffee Crumble,4,285,1140,Pune_West

In [15]:
df['Region'] = df['City'].str.split('_', expand=True)[1]

In [16]:
df["City"] = df["City"].str.split("_").str[0]

In [17]:
# above, we have created a seperate coulmn for region and then removed the region part from the city
df.head()

,Date,SalesRep,Product,Units,Price,Total Sales,City,Region
0,2013-01-01,Isabel Cross (903),Nestle Aero Mint Potz,4,495,1980,Ranchi,East
1,2013-01-02,Cecilia Manning (403),Nestle Smarties Pop-Up,2,438,876,Trivandrum,South
2,2013-01-02,Isabel Cross (705),Nestle Maxibon Cookie,1,426,426,Ranchi,East
3,2013-01-02,Shari Silva (321),Nestle Maxibon Cookie,2,260,520,Mysore,South
4,2013-01-02,Trevor Jones (802),Nestle Toffee Crumble,4,285,1140,Pune,West

In [18]:
# removing unnecessary numbers from the "SalesRep" column
df["SalesRep"] = df["SalesRep"].str.split(" \(").str[0]

<>:2: SyntaxWarning: invalid escape sequence '\('
<>:2: SyntaxWarning: invalid escape sequence '\('
C:\Users\notmo\AppData\Local\Temp\ipykernel_6156\2182998427.py:2: SyntaxWarning: invalid escape sequence '\('
  df["SalesRep"] = df["SalesRep"].str.split(" \(").str[0]

In [19]:
df.head()

,Date,SalesRep,Product,Units,Price,Total Sales,City,Region
0,2013-01-01,Isabel Cross,Nestle Aero Mint Potz,4,495,1980,Ranchi,East
1,2013-01-02,Cecilia Manning,Nestle Smarties Pop-Up,2,438,876,Trivandrum,South
2,2013-01-02,Isabel Cross,Nestle Maxibon Cookie,1,426,426,Ranchi,East
3,2013-01-02,Shari Silva,Nestle Maxibon Cookie,2,260,520,Mysore,South
4,2013-01-02,Trevor Jones,Nestle Toffee Crumble,4,285,1140,Pune,West

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         10000 non-null  object
 1   SalesRep     10000 non-null  object
 2   Product      10000 non-null  object
 3   Units        10000 non-null  object
 4   Price        10000 non-null  object
 5   Total Sales  10000 non-null  object
 6   City         10000 non-null  object
 7   Region       10000 non-null  object
dtypes: object(8)
memory usage: 625.1+ KB

In [21]:
# converting the columns to their appropirate datatype
for i in ["Units", "Price", "Total Sales"]:
    df[i] = pd.to_numeric( df[i] )

In [22]:
# converting the column to its appropirate datatype

df["Date"] = pd.to_datetime(df["Date"])

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         10000 non-null  datetime64[ns]
 1   SalesRep     10000 non-null  object
 2   Product      10000 non-null  object
 3   Units        10000 non-null  int64
 4   Price        10000 non-null  int64
 5   Total Sales  10000 non-null  int64
 6   City         10000 non-null  object
 7   Region       10000 non-null  object
dtypes: datetime64[ns](1), int64(3), object(4)
memory usage: 625.1+ KB

In [24]:
# Final output after performing data cleaning on excel file
df.head()

,Date,SalesRep,Product,Units,Price,Total Sales,City,Region
0,2013-01-01,Isabel Cross,Nestle Aero Mint Potz,4,495,1980,Ranchi,East
1,2013-01-02,Cecilia Manning,Nestle Smarties Pop-Up,2,438,876,Trivandrum,South
2,2013-01-02,Isabel Cross,Nestle Maxibon Cookie,1,426,426,Ranchi,East
3,2013-01-02,Shari Silva,Nestle Maxibon Cookie,2,260,520,Mysore,South
4,2013-01-02,Trevor Jones,Nestle Toffee Crumble,4,285,1140,Pune,West